; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph4 - mode
	image1 - mode
	spectrograph2 - mode
	thermograph3 - mode
	image0 - mode
	GroundStation2 - direction
	Star0 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image1)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument3 image1)
	(supports instrument3 spectrograph4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(supports instrument4 spectrograph4)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon3)
	(supports instrument5 image1)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument6 image0)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph4)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 thermograph3)
	(supports instrument8 image1)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon4)
	(supports instrument9 image0)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph3)
	(supports instrument10 spectrograph2)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon4)
)
(:goal (and
	(have_image Phenomenon3 image0)
	(have_image Planet5 image0)
	(have_image Star7 image0)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon10 image0)
	(have_image Planet11 spectrograph4)
	(have_image Phenomenon12 thermograph3)
	(have_image Star13 thermograph3)
	(have_image Phenomenon14 spectrograph2)
	(have_image Star15 image1)
	(have_image Planet17 image0)
	(have_image Planet18 thermograph3)
	(have_image Star19 spectrograph2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 13
4. (turn_to satellite4 groundstation1 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 13
5. (calibrate satellite4 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 13
6. (turn_to satellite4 phenomenon10 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 13
7. (take_image satellite4 phenomenon10 instrument10 image0)
   added: (have_image phenomenon10 image0)
   goals met: 1 of 13
8. (turn_to satellite4 phenomenon12 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 13
9. (take_image satellite4 phenomenon12 instrument10 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 2 of 13
10. (turn_to satellite4 phenomenon14 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon14)
   goals met: 2 of 13
11. (take_image satellite4 phenomenon14 instrument10 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 3 of 13
12. (turn_to satellite4 phenomenon3 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon3)
   goals met: 3 of 13
13. (take_image satellite4 phenomenon3 instrument10 image0)
   added: (have_image phenomenon3 image0)
   goals met: 4 of 13
14. (turn_to satellite4 planet17 phenomenon3)
   deleted: (pointing satellite4 phenomenon3)
   added: (pointing satellite4 planet17)
   goals met: 4 of 13
15. (take_image satellite4 planet17 instrument10 image0)
   added: (have_image planet17 image0)
   goals met: 5 of 13
16. (turn_to satellite4 planet18 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet18)
   goals met: 5 of 13
17. (take_image satellite4 planet18 instrument10 thermograph3)
   added: (have_image planet18 thermograph3)
   goals met: 6 of 13
18. (turn_to satellite4 planet5 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet5)
   goals met: 6 of 13
19. (take_image satellite4 planet5 instrument10 image0)
   added: (have_image planet5 image0)
   goals met: 7 of 13
20. (turn_to satellite4 star13 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star13)
   goals met: 7 of 13
21. (take_image satellite4 star13 instrument10 thermograph3)
   added: (have_image star13 thermograph3)
   goals met: 8 of 13
22. (turn_to satellite4 star19 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star19)
   goals met: 8 of 13
23. (take_image satellite4 star19 instrument10 spectrograph2)
   added: (have_image star19 spectrograph2)
   goals met: 9 of 13
24. (turn_to satellite4 star7 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star7)
   goals met: 9 of 13
25. (take_image satellite4 star7 instrument10 image0)
   added: (have_image star7 image0)
   goals met: 10 of 13
26. (turn_to satellite1 phenomenon8 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 phenomenon8)
   goals met: 10 of 13
27. (turn_to satellite1 star0 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star0)
   goals met: 10 of 13
28. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 10 of 13
29. (turn_to satellite1 phenomenon8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon8)
   goals met: 10 of 13
30. (take_image satellite1 phenomenon8 instrument4 image1)
   added: (have_image phenomenon8 image1)
   goals met: 11 of 13
31. (turn_to satellite1 planet11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet11)
   goals met: 11 of 13
32. (take_image satellite1 planet11 instrument4 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 12 of 13
33. (turn_to satellite1 star15 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star15)
   goals met: 12 of 13
34. (take_image satellite1 star15 instrument4 image1)
   added: (have_image star15 image1)
   goals met: 13 of 13
